Revit 2027 API
SketchPlane.Create Method
Overload List
Name | Description
Create(Document, ElementId) |  Creates a sketch plane from a grid, reference plane, or level.
Create(Document, Plane) |  Creates a new sketch plane from a geometric plane.
Create(Document, Reference) |  Creates a new sketch plane from a reference to a planar face.
Top
See Also
Reference
SketchPlane Class
Autodesk.Revit.DB Namespace